{
    "index_proyek" : "Proposal Proyek 3",
    "index_webfor" : "Ditujukan sebagai salah satu syarat mengikuti kegiatan Proyek 3 Program Studi DIV Teknik Informatika.",
        "titleProposal" : "MEMBANGUN APLIKASI WEBSITE PENDIDIKAN OTOMOTIF BERBASIS GO DAN JAVASCRIPT",
            "section1": "ABSTRAK",
            "paragraf_abstrak1": "Aplikasi pendidikan otomotif berbasis website merupakan proyek inovatif yang bertujuan untuk mengefektifkan pendidikan otomotif di era digital saat ini. Mengingat tantangan yang dihadapi siswa, seperti kurangnya akses terhadap materi pelajaran terkini dan kurangnya pengalaman praktis, aplikasi ini dirancang untuk mengatasi kendala tersebut. Berkat pendekatan gabungan teknologi Internet dan multimedia, aplikasi ini menyediakan platform pembelajaran yang kaya dan interaktif. Dengan cara ini, pengguna dapat dengan mudah mengakses materi pelatihan otomotif terkini dan relevan. Aplikasi ini tidak hanya memberikan pemahaman teoritis tentang konsep otomotif tetapi juga menawarkan simulasi realistis dan tes latihan yang memungkinkan  pengguna  mengasah keterampilan virtualnya.",
            "paragraf_abstrak2" : "Salah satu aspek kunci dari aplikasi ini adalah kemampuannya untuk menciptakan komunitas pembelajar yang dinamis. Dengan menyediakan forum diskusi dan fitur kolaboratif lainnya, aplikasi ini memfasilitasi pertukaran ide dan pengalaman antara para pengguna. Hal ini tidak hanya meningkatkan pemahaman mereka, tetapi juga membangun jaringan profesional yang berharga di dunia otomotif. Dengan menyatukan aspek edukatif dan sosial, Aplikasi Pendidikan Otomotif Berbasis Website bukan hanya sekadar alat pembelajaran, tetapi juga menjadi wadah bagi pengguna untuk mengembangkan diri mereka secara holistik. Dengan demikian, aplikasi ini tidak hanya membantu mengisi kesenjangan antara kebutuhan industri otomotif yang terus berkembang dan keterampilan yang dimiliki oleh para profesional di lapangan, tetapi juga merangsang minat dan semangat dalam bidang otomotif di kalangan para pembelajar.",
            "kata_kunci": "Kata Kunci : Aplikasi, Pendidikan, Otomotif.",
            "section2": "ABSTRACT",
            "paragraf_abstrak_english1": "The web-based automotive education app is an innovative project that aims to streamline automotive education in today's digital age. Given the challenges students face, such as lack of access to up-to-date subject matter and lack of practical experience, this app is designed to overcome these obstacles. Thanks to its combined approach of Internet and multimedia technologies, the app provides a rich and interactive learning platform. In this way, users can easily access current and relevant automotive training materials. The app not only provides a theoretical understanding of automotive concepts but also offers realistic simulations and practice tests that allow users to hone their virtual skills.",
            "paragraf_abstrak_english2": "One of the key aspects of this app is its ability to create a vibrant community of learners. By providing discussion forums and other collaborative features, the app facilitates the exchange of ideas and experiences between users. This not only enhances their understanding, but also builds a valuable network of professionals in the automotive world. By bringing together the educational and social aspects, the Web-based Automotive Education App is not just a learning tool, but also a platform for users to develop themselves holistically. As such, it not only helps fill the gap between the ever-growing needs of the automotive industry and the skills possessed by professionals in the field, but also stimulates interest and passion in the automotive field among learners.",
            "keywords": "Keywords: Aplication, Education, Automotive.",
            "section3": "DESKRIPSI",
            "paragraf_description1":
            "Aplikasi pendidikan otomotif berbasis web merupakan solusi inovatif yang dirancang untuk memberikan pengalaman belajar interaktif dan mendalam di dunia otomotif. Dengan antarmuka yang ramah pengguna, aplikasi ini memungkinkan pengguna mengakses berbagai konten edukasi otomotif dengan mudah dan cepat. Dengan fitur yang dirancang dengan cermat, aplikasi ini menawarkan modul pembelajaran komprehensif, termasuk video tutorial interaktif, artikel informatif, dan tes latihan untuk memeriksa tingkat pemahaman Anda. Pengguna dapat mendalami materi pembelajaran teknik otomotif, perawatan kendaraan, teknologi terkini, dan permasalahan umum yang dihadapi kendaraan.",
            "paragraf_description2": "Salah satu keunggulan utama aplikasi ini adalah aksesibilitasnya yang memungkinkan pengguna  belajar kapan saja, di mana saja melalui  komputer atau smartphone. Dengan forum diskusi dan komunitas pengguna, aplikasi ini juga memfasilitasi kolaborasi dan pertukaran pengetahuan antar pecinta mobil. Tidak hanya memberikan pengetahuan teoritis, aplikasi ini juga mencakup simulasi interaktif dan latihan praktis yang memungkinkan pengguna mengasah keterampilan otomotifnya secara virtual. Ini membantu pengguna mendapatkan kepercayaan diri dan keterampilan praktis yang dibutuhkan untuk sukses di industri otomotif. ",
            "paragraf_description3": "Menggunakan teknologi Internet dan multimedia, aplikasi pelatihan otomotif berbasis web menyediakan platform yang sangat efektif untuk membantu individu mengembangkan pemahaman mendalam tentang dunia otomotif, mempersiapkan diri untuk berkarir di industri yang sedang berkembang ini. Dengan konten berkualitas tinggi dan pengalaman belajar yang menarik, aplikasi ini tidak hanya menciptakan pembelajar yang berkualitas tetapi juga membangkitkan minat dan hasrat terhadap mobil.",
            "section4": "LATAR BELAKANG",
            "paragraf_latar1":
            "Permasalahan mendasar yang melatarbelakangi pengembangan aplikasi pendidikan otomotif berbasis web bermula dari kebutuhan mendesak untuk meningkatkan pendidikan otomotif dengan pendekatan yang lebih modern dan inovatif. Di era digital, industri otomotif terus berkembang pesat, namun pendidikan formal dan sumber belajar tidak selalu mampu mengimbangi perkembangan tersebut.",
            "paragraf_latar2": "Kurangnya akses terhadap materi pembelajaran otomotif yang terkini dan relevan menjadi tantangan besar bagi pembelajar, baik yang ingin berkarir di industri maupun  profesional yang ingin mengembangkan keterampilannya. Selain itu, metode pembelajaran tradisional seringkali terbatas kemampuannya dalam memberikan pengalaman langsung yang diperlukan untuk memahami konsep otomotif yang kompleks.",
            "paragraf_latar3": "Selain itu, dengan semakin berkembangnya teknologi, kendaraan bermotor pun semakin kompleks dan menggunakan teknologi yang semakin canggih. Oleh karena itu, sangatlah penting untuk memastikan bahwa mekanik dan teknisi mobil memiliki pengetahuan dan keterampilan terkini untuk menghadapi tantangan yang terus berubah ini. ",
            "paragraf_latar4": "Dalam konteks ini, aplikasi pendidikan otomotif berbasis web merupakan solusi yang sangat tepat. Dengan menyediakan akses terhadap materi pembelajaran otomotif yang praktis, interaktif dan terkini, aplikasi tidak hanya menjembatani kesenjangan aksesibilitas tetapi juga memberikan pengalaman belajar yang mendalam dan relevan. Hal ini membantu mengurangi kesenjangan antara kebutuhan industri otomotif dan pengetahuan para ahli di bidangnya.",
            "section5": "TUJUAN",
            "paragraf_tujuan": "Dari latar belakang diatas dapat diuraikan tujuan dari aplikasi kami sebagai berikut :",
            "tujuan_point1": "1. Untuk memberikan edukasi di bidang otomotif.",
            "tujuan_point2":  "2. Untuk mengetahui informasi perkembagan otomotif",
            "section6": "LINGKUP DOKUMENTASI",
            "paragraf_doc": "Adapun batasan-batasan dari penilitian kami yaitu sebagai berikut :",
            "doc_point1": "1. Bahasa pemrograman yang digunakan yaitu JavaScript ES6+ dan Go Language.",
            "doc_point2":  "2. Fitur yang ditampilkan yaitu video-video otomotif, perkembangan otomotif, penjelasan materi secara tulisan, dan lainnya."
}
    