{
    "title1": "KAJIAN PUSTAKA",
    "pustaka1": "1. Pengertian Website",
    "p1_whatis": "Website adalah software (perangkat lunak) yang digunakan untuk menampilkan dokumen pada suatu web yang memungkinkan pengguna mengakses internet melalui software yang terhubung ke Internet[1].",
    "p1_whatis2": "Untuk menampilkan hasil website dan teks editor menggunakan Website Browser yaitu sebuah aplikasi yang dapat menjelajahi, menyajikan, serta mengambil konten dari berbagai sumber informasi pada jaringan internet[2].",
    "p1_whatis3": "Fungsi Web Browser :",
    "p1_func1": "1.Sebagai alat atau media untuk browsing.",
    "p1_func2": "2.Dapat menyimpan data secara online.",
    "p1_func3": "3.Membuka file menggunakan ekstensi khusus.",
    "p1_whatis4": "Manfaat Web Browser:",
    "p1_pro1": "1.Memberikan kemudahan bagi pengguna ketika mengakses berbagai informasi di internet.",
    "p1_pro2": "2.Membantu pengguna dalam menyimpan berbagai file konten di internet menuju dokumen di komputer.",
    "p1_pro3": "3.Dapat digunakan untuk membuka berbagai macam situs yang bermanfaat untuk kegiatan manusia[3].",

    "pustaka2": "2. Pengertian Visual Studio Code (VSC)",
    "p2_whatis": "Visual Studio Code (VS Code) merupakan tempat pembuatan sebuah teks editor yang paling banyak digunakan karena aplikasi ini memudahkan pemula dalam membuat teks editor. Visual Studio Code (VSC) mendukung banyak bahasa pemrograman, Seperti : JavaScript, TypeScript, Node.js dan lain-lain[4].",
    "p2_whatis2": "Kelebihan dari VSCode yaitu :",
    "p2_pro1": "1. Dapat digunakan di semua sistem operasi, yaitu Windows, Linux, dan macos.",
    "p2_pro2": "2. Menyediakan banyak ekstensi untuk membuat pembuatan kode lebih mudah.",
    "p2_pro3": "3. Dapat diintegrasikan dengan Git.",
    "p2_pro4": "4. Dapat membuka terminal atau comand from pada aplikasi Visual Studio Code (VSCode).",
    "p2_pro5": "5. Memiliki tampilan yang sederhana.",
    "p2_whatis3": "Kekurangan dari VSCode yaitu :",
    "p2_cons1": "1. Performa aplikasi VSCode lebih berat untuk digunakan daripada text editor lainnya.",
    "p2_cons2": "2. Shortcurt key yang berbeda dengan text editor lainnya[5].",
    "pustaka3": "3. Pengertian HTML",
    
    "p3_whatis": "Hypertext Markup Language (HTML) merupakan bahasa pemrograman yang terstruktur digunakan untuk pembuatan laman website dapat diproses menggunakan web browser (perambanan web). HTML diciptakan oleh Tim Berners Lee pada tahun 1989 dan dikembangkan Worls Wide Web Consortium (W3C) dan terbentuk Web Hypertext Application Technology Working Group (WHATG) pada tahun 2004, hingga kini WHATG menggembangkan HTML sampai terbentuk HTML 5 yang dapat mendukung gambar, teks, video, audio, menu interaktif dan lain-lain[5].",
    "p3_whatis2": "Kelebihan dari HTML :",
    "p3_pro1": "1. Bahasa yang dipakai secara dan mempunyai banyak sumber serta komunitas yang besar.",
    "p3_pro2": "2. Dapat dijalankan setiap web browser.",
    "p3_pro3": "3. Open-source yang digunakan secara gratis.",
    "p3_pro4": "4. Bahasa markup yang tertata rapi dan konsisten.",
    "p3_pro5": "5. Dapat diintegrasikan dengan bahasa pemrograman yang dapat berjalan di sisi server seperti PHP, Asp, Java dan lain-lain.",
    "p3_whatis3": "Kekurangan dari HTML :",
    "p3_cons1": "HTML dipakai untuk membuat halaman website statis dan sederhana.",
    "p3_cons2": "HTML tidak dapat menjalankan logic, HTML merupakan bahasa pemrograman[6].",

    "pustaka4": "4. Pengertian CSS",
    "p4_whatis": "Cascading Style Sheets (CSS) merupakan bahasa pemrograman yang berfungsi sebagai web design. Penggunaan CSS untuk membuat tampilan web yang bagus dan menarik[7].",
    "p4_whatis2": "Kelebihan CSS : ",
    "p4_pro1": "1. Memisahkan desain dengan konten situs web.",
    "p4_pro2": "2. Mengelola desain dengan cara efisien.",
    "p4_pro3": "3. Lebih mudah untuk mengunduh karena lebih ringan dalam ukuran file.",
    "p4_pro4": "4. CSS dapat digunakan di banyak halaman web.",
    "p4_whatis3": "Kekurangan CSS : ",
    "p4_cons1": "1. Beberapa browser tidak mendukung CSS (browser lama).",
    "p4_cons2": "2. Butuh waktu lebih lama untuk membuat codingan CSS.",
    "p4_cons3": "3. Masih banyaknya bug/error dalam CSS[6].",

    "pustaka5": "5. Pengertian JavaScript",
    "p5_whatis": "Javascript merupakan sekumpulan skrip yang dijalankan pada dokumen HTML. Sepanjang sejarah Internet, bahasa ini telah menjadi bahasa pemrograman terkemuka untuk web. Bahasa ini merupakan bahasa pemrograman yang bertujuan untuk memberikan fungsionalitas tambahan pada bahasa HTML dengan mengizinkan eksekusi perintah di sisi pengguna, yaitu di sisi browser dan bukan di sisi server web. Javascript bergantung pada browser (browsing) yang memanggil halaman web yang berisi script Javascript dan tentunya tertanam dalam dokumen HTML[8].",
    "p5_whatis2": "Kelebihan JavaScript :",
    "p5_pro1": "1. Tidak memerlukan compiler karena web browser dapat menafsirkannya menggunakan HTML.",
    "p5_pro2": "2. Lebih mudah dipelajari  dibandingkan  bahasa pemrograman lainnya.",
    "p5_pro3": "3. Lebih mudah mendeteksi dan mengelola kesalahan atau cacat.",
    "p5_pro4": "4. Dapat dikaitkan dengan elemen  atau peristiwa tertentu pada website, misalnya klik atau mousehover.",
    "p5_pro5": "5. JavaScript dapat digunakan di semua browser, platform, dll.",
    "p5_pro6": "6. JavaScript dapat digunakan untuk memvalidasi data masukan dan mengurangi kebutuhan untuk memverifikasi data secara manual.",
    "p5_pro7": "7. Dengan JavaScript, website menjadi lebih interaktif dan juga dapat menarik perhatian lebih banyak pengunjung.",
    "p5_pro8": "8. Lebih cepat dan ringan dibandingkan bahasa pemrograman lainnya.",
    "p5_whatis3": "Kekurangan JavaScript :",
    "p5_cons1": "1. Resiko eksploitasi yang tinggi.",
    "p5_cons2": "2. Dapat digunakan untuk mengaktifkan kode berbahaya di komputer pengguna.",
    "p5_cons3": "3. Tidak selalu didukung oleh berbagai browser dan perangkat.",
    "p5_cons4": "4. Ada beragam kode JavaScript.",
    "p5_cons5": "5. Tampilannya mungkin berbeda pada setiap perangkat, sehingga dapat menyebabkan ketidakkonsisten[6].",

    "pustaka6": "6. Pengertian Database",
    "p6_whatis": "Database merupakan tabel-tabel dan kumpulan field atau kolom. Susunan file dari database yaitu Data, Record, dan Field.",
    "p6_known1": "1. Data merupakan bagian-bagian informasi yang akan diproses. Sebelum data diproses, data dikumpulkan dalam suatu file database.",
    "p6_known2": "2. Record merupakan data yang berisi sekumpulan Username dan Password. Keterangan yang berisi Username dan Password dinamakan satu record. Setiap record diberi nomor urut yang disebut nomor record (Record Number).",
    "p6_known3": "3. Field merupakan sub bagian dari record atau Nama judul dari record. Contohnya: Field Username dan Field Password.",
    "p6_whatis2": "Kelebihan dari database yaitu :",
    "p6_pro1": "1. Dengan setiap perubahan kecil, tidak perlu mengulang skema kompleks dalam database.",
    "p6_pro2": "2. Sifat fleksibel memungkinkan data dokumen disimpan pada berbagai tingkat.",
    "p6_pro3": "3. Kemampuan untuk menyimpan tipe data tidak terstruktur dengan semua metadata yang dimilikinya, seperti foto, video, dan lain-lain.",
    "p6_whatis3": "Kekurangan dari database yaitu :",
    "p6_cons1": "1. Informasi yang disimpan tidak dijamin ACID (Atomicity, Consistency, Isolation and Durability).",
    "p6_cons2": "2. Tidak cocok untuk menyimpan data dengan ukuran yang seragam, memiliki hubungan, seperti data transaksional[9].",
    
    "pustaka7": "7. Pengertian PostgreSQL",
    "p7_whatis": "PostgreSQL (dibaca Post-GresQ-L) atau postgres adalah sistem manajemen basis data relasional objek sumber terbuka. PostgreSQL menekankan skalabilitas, inovasi, dan kompatibilitas. Bersaing dengan vendor database relasional  besar seperti Oracle, MySQL, SQL Server, dan lainnya. Ini digunakan oleh berbagai sektor, termasuk  pemerintah dan organisasi publik serta sektor swasta. PostgreSQL adalah DBMS lintas platform dan bekerja pada sistem operasi apa pun. PostgreSQL adalah cross-platform DBMS, dan berjalan pada sistem operasi[10].",
    "p7_whatis2": "Bahasa kueri PostgreSQL adalah variasi dari standar SQL. PostgreSQL memiliki banyak ekstensi untuk SQL seperti tipe, pewarisan, fungsi, dan aturan produksi. Seperti kebanyakan bahasa relasional modern, SQL didasarkan pada kalkulus kumpulan data relasional. Dengan cara ini, hubungan yang dibuat akan menghasilkan kueri yang dapat dibangun menggunakan SQL. Berikut beberapa fitur tambahan  yang disediakan oleh SQL: Perintah untuk menyisipkan, menghapus, atau mengubah data kapasitas aritmatika; Tetapkan dan cetak perintahFungsi agregasi: seperti average, sum dan lainnya[11].",

    "title2": "DAFTAR PUSTAKA",
    "dafpus1": "[1] J. A. Stikom, U. Kupang, and N. T. Timur, “Rancang Bangun Sistem Informasi Desa Berbasis Website (Studi Kasus Desa Netpala),” 2019. Accessed: Oct. 07, 2023. [Online]. Available: https://ojs.cbn.ac.id/index.php/jukanti/article/view/17",
    "dafpus2": "[2] R. Y. Endra, Y. Aprilinda, Y. Y. Dharmawan, and W. Ramadhan, “Analisis Perbandingan Bahasa Pemrograman PHP Laravel dengan PHP Native pada Pengembangan Website,” EXPERT: Jurnal Manajemen Sistem Informasi dan Teknologi, vol. 11, no. 1, p. 48, Jun. 2021, doi: 10.36448/expert.v11i1.2012.",
    "dafpus3": "[3] Y. Wahyudin and D. N. Rahayu, “Analisis Metode Pengembangan Sistem Informasi Berbasis Website: A Literatur Review,” Jurnal Interkom: Jurnal Publikasi Ilmiah Bidang Teknologi Informasi dan Komunikasi, vol. 15, no. 3, pp. 26–40, Oct. 2020, doi: 10.35969/interkom.v15i3.74.",
    "dafpus4": "[4] T. N. PRATAMA, “SISTEM INFORMASI PENJUALAN BERBASIS WEB PADA  PT. PURNA BAJA HARSCO,” pp. i–132, 2022, Accessed: Oct. 07, 2023. [Online]. Available: https://elibrary.unikom.ac.id/id/eprint/7614/",
    "dafpus5": "[5] W. Joni Kurniawan, “Sistem E-Learning Do’a dan Iqro’ dalam Peningkatan Proses Pembelajaran pada TK Amal Ikhlas,” Jurnal Mahasiswa Aplikasi Teknologi Komputer dan Informasi, vol. 1, no. 3, pp. 154–159, 2019, Accessed: Oct. 07, 2023. [Online]. Available: https://www.ejournal.pelitaindonesia.ac.id/ojs32/index.php/jmapteksi/article/download/3015/1102",
    "dafpus6": "[6] S. D. R. K. M. A. R. R. SALSABILA, “E-LEARNING BERBASIS WEB UNTUK MENINGKATKAN EFEKTIVITAS PEMBELAJARAN SECARA DARING DI SEKOLAH DASAR,” Jawa Timur, 2021. Accessed: Oct. 07, 2023. [Online]. Available: http://repository.upnjatim.ac.id/6701/",
    "dafpus7": "[7] M. Saed Novendri et al., “APLIKASI INVENTARIS BARANG PADA MTS NURUL ISLAM DUMAI MENGGUNAKAN PHP DAN MYSQL,” 2019. Accessed: Oct. 07, 2023. [Online]. Available: http://ejournal.amikdumai.ac.id/index.php/Path/article/view/40",
    "dafpus8": "[8] A. Sahi, “APLIKASI TEST POTENSI AKADEMIK SELEKSI SARINGAN MASUK LP3I BERBASIS WEB ONLINE MENGGUNAKAN FRAMEWORK CODEIGNITER,” 2020. Accessed: Oct. 07, 2023. [Online]. Available: http://jurnal.plb.ac.id/index.php/tematik/article/view/386",
    "dafpus9": "[9] H. Fauzi Siregar, Y. Handika Siregar, and J. Jend Ahmad Yani Kisaran Sumatera Utara, “Perancangan Aplikasi Komik Hadist Berbasis Multimedia,” Jurnal Teknologi Informasi, vol. 2, no. 2, 2018.",
    "dafpus10": "[10] T. S. Waruwu, “IMPLEMENTASI POSTGRESQL SEBAGAI SISTEM MANAJEMEN BASIS DATA PADA PENDAFTARAN MAHASISWA BARU BERBASIS WEB,” pp. 57–61, 2019, Accessed: Oct. 07, 2023. [Online]. Available: http://e-journal.sari-mutiara.ac.id/index.php/7/article/view/728",
    "dafpus11": "[11] D. K. , Y. H. Berry Junanda, “PENCARIAN RUTE TERPENDEK MENGGUNAKAN ALGORITMA DIJKSTRA PADA SISTEM  INFORMASI GEOGRAFIS PEMETAAN STASIUN PENGISIAN BAHAN BAKAR UMUM,” Teknik Elektronika & Informatika, vol. 4, no. 1, 2018, Accessed: Oct. 07, 2023. [Online]. Available: https://ejournal.unp.ac.id/index.php/voteknika/article/view/6014/4686"
}